Revit 2027 API
BuiltInFailures.EditingFailures.AllInvisibleInPlanViewWarn Property
 None of the created elements are visible in [View Type] View. You may want to check the active view, its Parameters, and Visibility settings, as well as any Plan Regions and their settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AllInvisibleInPlanViewWarn { get; }
Public Shared ReadOnly Property AllInvisibleInPlanViewWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AllInvisibleInPlanViewWarn {
	FailureDefinitionId^ get ();
}
static member AllInvisibleInPlanViewWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace